app/controllers/clientes_controller.rb

  def create
    @cliente = Cliente.new(cliente_params)

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("nome", "cpf", "senha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Thais"], ["cpf", 1425], ["senha", "4545454"], ["created_at", "2016-04-26 23:47:46.933265"], ["updated_at", "2016-04-26 23:47:46.933265"]]

  def update
    respond_to do |format|
      if @cliente.update(cliente_params)
---
UPDATE "clientes" SET "nome" = ?, "cpf" = ?, "nacionalidade" = ?, "dtNasc" = ?, "cep" = ?, "endereco" = ?, "bairro" = ?, "cidade" = ?, "estado" = ?, "celular" = ?, "email" = ?, "senha" = ?, "updated_at" = ? WHERE "clientes"."id" = ?