app/controllers/estabelecimentos_controller.rb

  def index
    @estabelecimentos = Estabelecimento.all
---
SELECT "estabelecimentos".* FROM "estabelecimentos"

  def create
    @estabelecimento = Estabelecimento.new(estabelecimento_params)

    respond_to do |format|
      if @estabelecimento.save
---
INSERT INTO "estabelecimentos" ("cnpj", "empresa", "email", "senha", "tipo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @estabelecimento.update(estabelecimento_params)
---
UPDATE "estabelecimentos" SET "cnpj" = ?, "empresa" = ?, "email" = ?, "senha" = ?, "tipo" = ?, "updated_at" = ? WHERE "estabelecimentos"."id" = ?  [["cnpj", "123456789987456"], ["empresa", "Barra Music"], ["email", "barramusic@rio.rj.gov.br"], ["senha", "12345678"], ["tipo", "Boate"], ["updated_at", "2016-05-10 01:40:34.325241"], ["id", 1]]

  def destroy
    @estabelecimento.destroy
---
DELETE FROM "estabelecimentos" WHERE "estabelecimentos"."id" = ?  [["id", 1]]

    def set_estabelecimento
      @estabelecimento = Estabelecimento.find(params[:id])
---
SELECT  "estabelecimentos".* FROM "estabelecimentos" WHERE "estabelecimentos"."id" = ? LIMIT 1  [["id", 1]]