app/controllers/eventos_controller.rb

INSERT INTO "eventos" ("descricao", "data", "horario", "local", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["descricao", "Saturday Night"], ["data", "30-04-2016"], ["horario", "23:00"], ["local", "Barra Music"], ["created_at", "2016-05-10 01:44:22.629796"], ["updated_at", "2016-05-10 01:44:22.629796"]]
---
  def create
    @evento = Evento.new(evento_params)

    respond_to do |format|
      if @evento.save

UPDATE "eventos" SET "descricao" = ?, "data" = ?, "horario" = ?, "local" = ?, "updated_at" = ? WHERE "eventos"."id" = ?  [["descricao", "Saturday Night"], ["data", "30-04-2016"], ["horario", "23:00"], ["local", "Barra Music"], ["updated_at", "2016-05-10 01:44:22.913397"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @evento.update(evento_params)

DELETE FROM "eventos" WHERE "eventos"."id" = ?  [["id", 1]]
---
  def destroy
    @evento.destroy

SELECT  "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_evento
      @evento = Evento.find(params[:id])