app/controllers/ingressos_controller.rb

  def index
    @ingressos = Ingresso.all
---
SELECT "ingressos".* FROM "ingressos"

  def destroy
    @ingresso.destroy
---
DELETE FROM "ingressos" WHERE "ingressos"."id" = ?  [["id", 1]]

    def set_ingresso
      @ingresso = Ingresso.find(params[:id])
---
SELECT  "ingressos".* FROM "ingressos" WHERE "ingressos"."id" = ? LIMIT 1  [["id", 1]]