app/controllers/reservas_controller.rb

  def index
    @reservas = Reserva.all
---
SELECT "reservas".* FROM "reservas"

  def create
    @reserva = Reserva.new(reserva_params)

    respond_to do |format|
      if @reserva.save
---
INSERT INTO "reservas" ("Cliente_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["Cliente_id", 1], ["created_at", "2016-04-26 23:54:35.081777"], ["updated_at", "2016-04-26 23:54:35.081777"]]

  def destroy
    @reserva.destroy
---
DELETE FROM "reservas" WHERE "reservas"."id" = ?  [["id", 1]]

    def set_reserva
      @reserva = Reserva.find(params[:id])
---
SELECT  "reservas".* FROM "reservas" WHERE "reservas"."id" = ? LIMIT 1  [["id", 1]]